MikroElektronika/core_packages/PIC/XC8/def/PIC16F18875/mcu.h
extern volatile CWG3AS1bits_t CWG3AS1bits __at(0x693);
// bitfield macros
#define _CWG3AS1_AS0E_POSN                                  0x0
#define _CWG3AS1_AS0E_POSITION                              0x0
#define _CWG3AS1_AS0E_SIZE                                  0x1
#define _CWG3AS1_AS0E_LENGTH                                0x1
#define _CWG3AS1_AS0E_MASK                                  0x1
#define _CWG3AS1_AS1E_POSN                                  0x1
#define _CWG3AS1_AS1E_POSITION                              0x1
#define _CWG3AS1_AS1E_SIZE                                  0x1
#define _CWG3AS1_AS1E_LENGTH                                0x1
#define _CWG3AS1_AS1E_MASK                                  0x2
#define _CWG3AS1_AS2E_POSN                                  0x2
#define _CWG3AS1_AS2E_POSITION                              0x2
#define _CWG3AS1_AS2E_SIZE                                  0x1
#define _CWG3AS1_AS2E_LENGTH                                0x1
#define _CWG3AS1_AS2E_MASK                                  0x4
#define _CWG3AS1_AS3E_POSN                                  0x3
#define _CWG3AS1_AS3E_POSITION                              0x3
#define _CWG3AS1_AS3E_SIZE                                  0x1
#define _CWG3AS1_AS3E_LENGTH                                0x1
#define _CWG3AS1_AS3E_MASK                                  0x8
#define _CWG3AS1_AS4E_POSN                                  0x4
#define _CWG3AS1_AS4E_POSITION                              0x4
#define _CWG3AS1_AS4E_SIZE                                  0x1
#define _CWG3AS1_AS4E_LENGTH                                0x1
#define _CWG3AS1_AS4E_MASK                                  0x10
#define _CWG3AS1_AS5E_POSN                                  0x5
#define _CWG3AS1_AS5E_POSITION                              0x5
#define _CWG3AS1_AS5E_SIZE                                  0x1
#define _CWG3AS1_AS5E_LENGTH                                0x1
#define _CWG3AS1_AS5E_MASK                                  0x20
#define _CWG3AS1_AS6E_POSN                                  0x6
#define _CWG3AS1_AS6E_POSITION                              0x6
#define _CWG3AS1_AS6E_SIZE                                  0x1
#define _CWG3AS1_AS6E_LENGTH                                0x1
#define _CWG3AS1_AS6E_MASK                                  0x40

// Register: CWG3STR
#define CWG3STR CWG3STR
extern volatile unsigned char           CWG3STR             __at(0x694);
#ifndef _LIB_BUILD
asm("CWG3STR equ 0694h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned OVRA                   :1;
        unsigned OVRB                   :1;
        unsigned OVRC                   :1;
        unsigned OVRD                   :1;
    };
    struct {
        unsigned CWG3STRA               :1;
        unsigned CWG3STRB               :1;
        unsigned CWG3STRC               :1;
        unsigned CWG3STRD               :1;
        unsigned CWG3OVRA               :1;
        unsigned CWG3OVRB               :1;
        unsigned CWG3OVRC               :1;
        unsigned CWG3OVRD               :1;
    };
} CWG3STRbits_t;
extern volatile CWG3STRbits_t CWG3STRbits __at(0x694);
// bitfield macros
#define _CWG3STR_STRA_POSN                                  0x0
#define _CWG3STR_STRA_POSITION                              0x0
#define _CWG3STR_STRA_SIZE                                  0x1
#define _CWG3STR_STRA_LENGTH                                0x1
#define _CWG3STR_STRA_MASK                                  0x1
#define _CWG3STR_STRB_POSN                                  0x1
#define _CWG3STR_STRB_POSITION                              0x1
#define _CWG3STR_STRB_SIZE                                  0x1
#define _CWG3STR_STRB_LENGTH                                0x1
#define _CWG3STR_STRB_MASK                                  0x2
#define _CWG3STR_STRC_POSN                                  0x2
#define _CWG3STR_STRC_POSITION                              0x2
#define _CWG3STR_STRC_SIZE                                  0x1
#define _CWG3STR_STRC_LENGTH                                0x1
#define _CWG3STR_STRC_MASK                                  0x4
#define _CWG3STR_STRD_POSN                                  0x3
#define _CWG3STR_STRD_POSITION                              0x3
#define _CWG3STR_STRD_SIZE                                  0x1
#define _CWG3STR_STRD_LENGTH                                0x1
#define _CWG3STR_STRD_MASK                                  0x8
#define _CWG3STR_OVRA_POSN                                  0x4
#define _CWG3STR_OVRA_POSITION                              0x4
#define _CWG3STR_OVRA_SIZE                                  0x1
#define _CWG3STR_OVRA_LENGTH                                0x1
#define _CWG3STR_OVRA_MASK                                  0x10
#define _CWG3STR_OVRB_POSN                                  0x5
#define _CWG3STR_OVRB_POSITION                              0x5
#define _CWG3STR_OVRB_SIZE                                  0x1
#define _CWG3STR_OVRB_LENGTH                                0x1
#define _CWG3STR_OVRB_MASK                                  0x20
#define _CWG3STR_OVRC_POSN                                  0x6
#define _CWG3STR_OVRC_POSITION                              0x6
#define _CWG3STR_OVRC_SIZE                                  0x1
#define _CWG3STR_OVRC_LENGTH                                0x1
#define _CWG3STR_OVRC_MASK                                  0x40
#define _CWG3STR_OVRD_POSN                                  0x7
#define _CWG3STR_OVRD_POSITION                              0x7
#define _CWG3STR_OVRD_SIZE                                  0x1
#define _CWG3STR_OVRD_LENGTH                                0x1
#define _CWG3STR_OVRD_MASK                                  0x80
#define _CWG3STR_CWG3STRA_POSN                              0x0
#define _CWG3STR_CWG3STRA_POSITION                          0x0
#define _CWG3STR_CWG3STRA_SIZE                              0x1
#define _CWG3STR_CWG3STRA_LENGTH                            0x1
#define _CWG3STR_CWG3STRA_MASK                              0x1
#define _CWG3STR_CWG3STRB_POSN                              0x1
#define _CWG3STR_CWG3STRB_POSITION                          0x1
#define _CWG3STR_CWG3STRB_SIZE                              0x1
#define _CWG3STR_CWG3STRB_LENGTH                            0x1
#define _CWG3STR_CWG3STRB_MASK                              0x2
#define _CWG3STR_CWG3STRC_POSN                              0x2
#define _CWG3STR_CWG3STRC_POSITION                          0x2
#define _CWG3STR_CWG3STRC_SIZE                              0x1
#define _CWG3STR_CWG3STRC_LENGTH                            0x1
#define _CWG3STR_CWG3STRC_MASK                              0x4
#define _CWG3STR_CWG3STRD_POSN                              0x3
#define _CWG3STR_CWG3STRD_POSITION                          0x3
#define _CWG3STR_CWG3STRD_SIZE                              0x1
#define _CWG3STR_CWG3STRD_LENGTH                            0x1
#define _CWG3STR_CWG3STRD_MASK                              0x8
#define _CWG3STR_CWG3OVRA_POSN                              0x4
#define _CWG3STR_CWG3OVRA_POSITION                          0x4
#define _CWG3STR_CWG3OVRA_SIZE                              0x1
#define _CWG3STR_CWG3OVRA_LENGTH                            0x1
#define _CWG3STR_CWG3OVRA_MASK                              0x10
#define _CWG3STR_CWG3OVRB_POSN                              0x5
#define _CWG3STR_CWG3OVRB_POSITION                          0x5
#define _CWG3STR_CWG3OVRB_SIZE                              0x1
#define _CWG3STR_CWG3OVRB_LENGTH                            0x1
#define _CWG3STR_CWG3OVRB_MASK                              0x20
#define _CWG3STR_CWG3OVRC_POSN                              0x6
#define _CWG3STR_CWG3OVRC_POSITION                          0x6
#define _CWG3STR_CWG3OVRC_SIZE                              0x1
#define _CWG3STR_CWG3OVRC_LENGTH                            0x1
#define _CWG3STR_CWG3OVRC_MASK                              0x40
#define _CWG3STR_CWG3OVRD_POSN                              0x7
#define _CWG3STR_CWG3OVRD_POSITION                          0x7
#define _CWG3STR_CWG3OVRD_SIZE                              0x1
#define _CWG3STR_CWG3OVRD_LENGTH                            0x1
#define _CWG3STR_CWG3OVRD_MASK                              0x80

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x70C);
#ifndef _LIB_BUILD
asm("PIR0 equ 070Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTF                   :1;
        unsigned                        :3;
        unsigned IOCIF                  :1;
        unsigned TMR0IF                 :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x70C);
// bitfield macros
#define _PIR0_INTF_POSN                                     0x0
#define _PIR0_INTF_POSITION                                 0x0
#define _PIR0_INTF_SIZE                                     0x1
#define _PIR0_INTF_LENGTH                                   0x1
#define _PIR0_INTF_MASK                                     0x1
#define _PIR0_IOCIF_POSN                                    0x4
#define _PIR0_IOCIF_POSITION                                0x4
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x10
#define _PIR0_TMR0IF_POSN                                   0x5
#define _PIR0_TMR0IF_POSITION                               0x5
#define _PIR0_TMR0IF_SIZE                                   0x1
#define _PIR0_TMR0IF_LENGTH                                 0x1
#define _PIR0_TMR0IF_MASK                                   0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x70D);
#ifndef _LIB_BUILD
asm("PIR1 equ 070Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned                        :4;
        unsigned CSWIF                  :1;
        unsigned OSFIF                  :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x70D);
// bitfield macros
#define _PIR1_ADIF_POSN                                     0x0
#define _PIR1_ADIF_POSITION                                 0x0
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x1
#define _PIR1_ADTIF_POSN                                    0x1
#define _PIR1_ADTIF_POSITION                                0x1
#define _PIR1_ADTIF_SIZE                                    0x1
#define _PIR1_ADTIF_LENGTH                                  0x1
#define _PIR1_ADTIF_MASK                                    0x2
#define _PIR1_CSWIF_POSN                                    0x6
#define _PIR1_CSWIF_POSITION                                0x6
#define _PIR1_CSWIF_SIZE                                    0x1
#define _PIR1_CSWIF_LENGTH                                  0x1
#define _PIR1_CSWIF_MASK                                    0x40
#define _PIR1_OSFIF_POSN                                    0x7
#define _PIR1_OSFIF_POSITION                                0x7
#define _PIR1_OSFIF_SIZE                                    0x1
#define _PIR1_OSFIF_LENGTH                                  0x1
#define _PIR1_OSFIF_MASK                                    0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x70E);
#ifndef _LIB_BUILD
asm("PIR2 equ 070Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IF                   :1;
        unsigned C2IF                   :1;
        unsigned                        :4;
        unsigned ZCDIF                  :1;
    };
} PIR2bits_t;
extern volatile PIR2bits_t PIR2bits __at(0x70E);
// bitfield macros
#define _PIR2_C1IF_POSN                                     0x0
#define _PIR2_C1IF_POSITION                                 0x0
#define _PIR2_C1IF_SIZE                                     0x1
#define _PIR2_C1IF_LENGTH                                   0x1
#define _PIR2_C1IF_MASK                                     0x1
#define _PIR2_C2IF_POSN                                     0x1
#define _PIR2_C2IF_POSITION                                 0x1
#define _PIR2_C2IF_SIZE                                     0x1
#define _PIR2_C2IF_LENGTH                                   0x1
#define _PIR2_C2IF_MASK                                     0x2
#define _PIR2_ZCDIF_POSN                                    0x6
#define _PIR2_ZCDIF_POSITION                                0x6
#define _PIR2_ZCDIF_SIZE                                    0x1
#define _PIR2_ZCDIF_LENGTH                                  0x1
#define _PIR2_ZCDIF_MASK                                    0x40

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x70F);
#ifndef _LIB_BUILD
asm("PIR3 equ 070Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1IF                 :1;
        unsigned BCL1IF                 :1;
        unsigned SSP2IF                 :1;
        unsigned BCL2IF                 :1;
        unsigned TXIF                   :1;
        unsigned RCIF                   :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x70F);
// bitfield macros
#define _PIR3_SSP1IF_POSN                                   0x0
#define _PIR3_SSP1IF_POSITION                               0x0
#define _PIR3_SSP1IF_SIZE                                   0x1
#define _PIR3_SSP1IF_LENGTH                                 0x1
#define _PIR3_SSP1IF_MASK                                   0x1
#define _PIR3_BCL1IF_POSN                                   0x1
#define _PIR3_BCL1IF_POSITION                               0x1
#define _PIR3_BCL1IF_SIZE                                   0x1
#define _PIR3_BCL1IF_LENGTH                                 0x1
#define _PIR3_BCL1IF_MASK                                   0x2
#define _PIR3_SSP2IF_POSN                                   0x2
#define _PIR3_SSP2IF_POSITION                               0x2
#define _PIR3_SSP2IF_SIZE                                   0x1
#define _PIR3_SSP2IF_LENGTH                                 0x1
#define _PIR3_SSP2IF_MASK                                   0x4
#define _PIR3_BCL2IF_POSN                                   0x3
#define _PIR3_BCL2IF_POSITION                               0x3
#define _PIR3_BCL2IF_SIZE                                   0x1
#define _PIR3_BCL2IF_LENGTH                                 0x1
#define _PIR3_BCL2IF_MASK                                   0x8
#define _PIR3_TXIF_POSN                                     0x4
#define _PIR3_TXIF_POSITION                                 0x4
#define _PIR3_TXIF_SIZE                                     0x1
#define _PIR3_TXIF_LENGTH                                   0x1
#define _PIR3_TXIF_MASK                                     0x10
#define _PIR3_RCIF_POSN                                     0x5
#define _PIR3_RCIF_POSITION                                 0x5
#define _PIR3_RCIF_SIZE                                     0x1
#define _PIR3_RCIF_LENGTH                                   0x1
#define _PIR3_RCIF_MASK                                     0x20

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x710);
#ifndef _LIB_BUILD
asm("PIR4 equ 0710h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned TMR3IF                 :1;
        unsigned TMR4IF                 :1;
        unsigned TMR5IF                 :1;
        unsigned TMR6IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x710);
// bitfield macros
#define _PIR4_TMR1IF_POSN                                   0x0
#define _PIR4_TMR1IF_POSITION                               0x0
#define _PIR4_TMR1IF_SIZE                                   0x1
#define _PIR4_TMR1IF_LENGTH                                 0x1
#define _PIR4_TMR1IF_MASK                                   0x1
#define _PIR4_TMR2IF_POSN                                   0x1
#define _PIR4_TMR2IF_POSITION                               0x1
#define _PIR4_TMR2IF_SIZE                                   0x1
#define _PIR4_TMR2IF_LENGTH                                 0x1
#define _PIR4_TMR2IF_MASK                                   0x2
#define _PIR4_TMR3IF_POSN                                   0x2
#define _PIR4_TMR3IF_POSITION                               0x2
#define _PIR4_TMR3IF_SIZE                                   0x1
#define _PIR4_TMR3IF_LENGTH                                 0x1
#define _PIR4_TMR3IF_MASK                                   0x4
#define _PIR4_TMR4IF_POSN                                   0x3
#define _PIR4_TMR4IF_POSITION                               0x3
#define _PIR4_TMR4IF_SIZE                                   0x1
#define _PIR4_TMR4IF_LENGTH                                 0x1
#define _PIR4_TMR4IF_MASK                                   0x8
#define _PIR4_TMR5IF_POSN                                   0x4
#define _PIR4_TMR5IF_POSITION                               0x4
#define _PIR4_TMR5IF_SIZE                                   0x1
#define _PIR4_TMR5IF_LENGTH                                 0x1
#define _PIR4_TMR5IF_MASK                                   0x10
#define _PIR4_TMR6IF_POSN                                   0x5
#define _PIR4_TMR6IF_POSITION                               0x5
#define _PIR4_TMR6IF_SIZE                                   0x1
#define _PIR4_TMR6IF_LENGTH                                 0x1
#define _PIR4_TMR6IF_MASK                                   0x20

