MikroElektronika/core_packages/PIC/XC8/def/PIC16F18875/mcu.h
extern volatile ZCDCONbits_t ZCDCONbits __at(0x91F);
// bitfield macros
#define _ZCDCON_INTN_POSN                                   0x0
#define _ZCDCON_INTN_POSITION                               0x0
#define _ZCDCON_INTN_SIZE                                   0x1
#define _ZCDCON_INTN_LENGTH                                 0x1
#define _ZCDCON_INTN_MASK                                   0x1
#define _ZCDCON_INTP_POSN                                   0x1
#define _ZCDCON_INTP_POSITION                               0x1
#define _ZCDCON_INTP_SIZE                                   0x1
#define _ZCDCON_INTP_LENGTH                                 0x1
#define _ZCDCON_INTP_MASK                                   0x2
#define _ZCDCON_POL_POSN                                    0x4
#define _ZCDCON_POL_POSITION                                0x4
#define _ZCDCON_POL_SIZE                                    0x1
#define _ZCDCON_POL_LENGTH                                  0x1
#define _ZCDCON_POL_MASK                                    0x10
#define _ZCDCON_OUT_POSN                                    0x5
#define _ZCDCON_OUT_POSITION                                0x5
#define _ZCDCON_OUT_SIZE                                    0x1
#define _ZCDCON_OUT_LENGTH                                  0x1
#define _ZCDCON_OUT_MASK                                    0x20
#define _ZCDCON_EN_POSN                                     0x7
#define _ZCDCON_EN_POSITION                                 0x7
#define _ZCDCON_EN_SIZE                                     0x1
#define _ZCDCON_EN_LENGTH                                   0x1
#define _ZCDCON_EN_MASK                                     0x80
#define _ZCDCON_ZCD1INTN_POSN                               0x0
#define _ZCDCON_ZCD1INTN_POSITION                           0x0
#define _ZCDCON_ZCD1INTN_SIZE                               0x1
#define _ZCDCON_ZCD1INTN_LENGTH                             0x1
#define _ZCDCON_ZCD1INTN_MASK                               0x1
#define _ZCDCON_ZCD1INTP_POSN                               0x1
#define _ZCDCON_ZCD1INTP_POSITION                           0x1
#define _ZCDCON_ZCD1INTP_SIZE                               0x1
#define _ZCDCON_ZCD1INTP_LENGTH                             0x1
#define _ZCDCON_ZCD1INTP_MASK                               0x2
#define _ZCDCON_ZCD1POL_POSN                                0x4
#define _ZCDCON_ZCD1POL_POSITION                            0x4
#define _ZCDCON_ZCD1POL_SIZE                                0x1
#define _ZCDCON_ZCD1POL_LENGTH                              0x1
#define _ZCDCON_ZCD1POL_MASK                                0x10
#define _ZCDCON_ZCD1OUT_POSN                                0x5
#define _ZCDCON_ZCD1OUT_POSITION                            0x5
#define _ZCDCON_ZCD1OUT_SIZE                                0x1
#define _ZCDCON_ZCD1OUT_LENGTH                              0x1
#define _ZCDCON_ZCD1OUT_MASK                                0x20
#define _ZCDCON_ZCD1EN_POSN                                 0x7
#define _ZCDCON_ZCD1EN_POSITION                             0x7
#define _ZCDCON_ZCD1EN_SIZE                                 0x1
#define _ZCDCON_ZCD1EN_LENGTH                               0x1
#define _ZCDCON_ZCD1EN_MASK                                 0x80
#define _ZCDCON_ZCDINTN_POSN                                0x0
#define _ZCDCON_ZCDINTN_POSITION                            0x0
#define _ZCDCON_ZCDINTN_SIZE                                0x1
#define _ZCDCON_ZCDINTN_LENGTH                              0x1
#define _ZCDCON_ZCDINTN_MASK                                0x1
#define _ZCDCON_ZCDINTP_POSN                                0x1
#define _ZCDCON_ZCDINTP_POSITION                            0x1
#define _ZCDCON_ZCDINTP_SIZE                                0x1
#define _ZCDCON_ZCDINTP_LENGTH                              0x1
#define _ZCDCON_ZCDINTP_MASK                                0x2
#define _ZCDCON_ZCDPOL_POSN                                 0x4
#define _ZCDCON_ZCDPOL_POSITION                             0x4
#define _ZCDCON_ZCDPOL_SIZE                                 0x1
#define _ZCDCON_ZCDPOL_LENGTH                               0x1
#define _ZCDCON_ZCDPOL_MASK                                 0x10
#define _ZCDCON_ZCDOUT_POSN                                 0x5
#define _ZCDCON_ZCDOUT_POSITION                             0x5
#define _ZCDCON_ZCDOUT_SIZE                                 0x1
#define _ZCDCON_ZCDOUT_LENGTH                               0x1
#define _ZCDCON_ZCDOUT_MASK                                 0x20
#define _ZCDCON_ZCDEN_POSN                                  0x7
#define _ZCDCON_ZCDEN_POSITION                              0x7
#define _ZCDCON_ZCDEN_SIZE                                  0x1
#define _ZCDCON_ZCDEN_LENGTH                                0x1
#define _ZCDCON_ZCDEN_MASK                                  0x80

// Register: CMOUT
#define CMOUT CMOUT
extern volatile unsigned char           CMOUT               __at(0x98F);
#ifndef _LIB_BUILD
asm("CMOUT equ 098Fh");
#endif
// aliases
extern volatile unsigned char           CMSTAT              __at(0x98F);
#ifndef _LIB_BUILD
asm("CMSTAT equ 098Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MC1OUT                 :1;
        unsigned MC2OUT                 :1;
    };
    struct {
        unsigned C1OUT                  :1;
        unsigned C2OUT                  :1;
    };
} CMOUTbits_t;
extern volatile CMOUTbits_t CMOUTbits __at(0x98F);
// bitfield macros
#define _CMOUT_MC1OUT_POSN                                  0x0
#define _CMOUT_MC1OUT_POSITION                              0x0
#define _CMOUT_MC1OUT_SIZE                                  0x1
#define _CMOUT_MC1OUT_LENGTH                                0x1
#define _CMOUT_MC1OUT_MASK                                  0x1
#define _CMOUT_MC2OUT_POSN                                  0x1
#define _CMOUT_MC2OUT_POSITION                              0x1
#define _CMOUT_MC2OUT_SIZE                                  0x1
#define _CMOUT_MC2OUT_LENGTH                                0x1
#define _CMOUT_MC2OUT_MASK                                  0x2
#define _CMOUT_C1OUT_POSN                                   0x0
#define _CMOUT_C1OUT_POSITION                               0x0
#define _CMOUT_C1OUT_SIZE                                   0x1
#define _CMOUT_C1OUT_LENGTH                                 0x1
#define _CMOUT_C1OUT_MASK                                   0x1
#define _CMOUT_C2OUT_POSN                                   0x1
#define _CMOUT_C2OUT_POSITION                               0x1
#define _CMOUT_C2OUT_SIZE                                   0x1
#define _CMOUT_C2OUT_LENGTH                                 0x1
#define _CMOUT_C2OUT_MASK                                   0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned MC1OUT                 :1;
        unsigned MC2OUT                 :1;
    };
    struct {
        unsigned C1OUT                  :1;
        unsigned C2OUT                  :1;
    };
} CMSTATbits_t;
extern volatile CMSTATbits_t CMSTATbits __at(0x98F);
// bitfield macros
#define _CMSTAT_MC1OUT_POSN                                 0x0
#define _CMSTAT_MC1OUT_POSITION                             0x0
#define _CMSTAT_MC1OUT_SIZE                                 0x1
#define _CMSTAT_MC1OUT_LENGTH                               0x1
#define _CMSTAT_MC1OUT_MASK                                 0x1
#define _CMSTAT_MC2OUT_POSN                                 0x1
#define _CMSTAT_MC2OUT_POSITION                             0x1
#define _CMSTAT_MC2OUT_SIZE                                 0x1
#define _CMSTAT_MC2OUT_LENGTH                               0x1
#define _CMSTAT_MC2OUT_MASK                                 0x2
#define _CMSTAT_C1OUT_POSN                                  0x0
#define _CMSTAT_C1OUT_POSITION                              0x0
#define _CMSTAT_C1OUT_SIZE                                  0x1
#define _CMSTAT_C1OUT_LENGTH                                0x1
#define _CMSTAT_C1OUT_MASK                                  0x1
#define _CMSTAT_C2OUT_POSN                                  0x1
#define _CMSTAT_C2OUT_POSITION                              0x1
#define _CMSTAT_C2OUT_SIZE                                  0x1
#define _CMSTAT_C2OUT_LENGTH                                0x1
#define _CMSTAT_C2OUT_MASK                                  0x2

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x990);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 0990h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :2;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C1SYNC                 :1;
        unsigned C1HYS                  :1;
        unsigned C1SP                   :1;
        unsigned                        :1;
        unsigned C1POL                  :1;
        unsigned                        :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
} CM1CON0bits_t;
